In [73]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math
from numpy.random import rand, randn, randint

In [4]:
labels = ['a', 'b', 'c']
arr = np.array([10, 20, 30])

In [5]:
pd.Series(data = arr)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data = arr, index = labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series([5, 6, 7], index=['q', 'w', 'e'])

q    5
w    6
e    7
dtype: int64

In [8]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series() # enter (Shift + Tab) for additional information

Series([], dtype: float64)

In [10]:
a = pd.Series([2, 3, 5, 7], ["Compukter", "Monitor4ik", "Miwka", "Klava"])

In [11]:
b = pd.Series([9, 11, 13, 17], ["Compukter", "Monitor4ik", "Miwka", "Hardak"])

In [12]:
a + b

Compukter     11.0
Hardak         NaN
Klava          NaN
Miwka         18.0
Monitor4ik    14.0
dtype: float64

In [13]:
a * 2

Compukter      4
Monitor4ik     6
Miwka         10
Klava         14
dtype: int64

In [14]:
b * 10

Compukter      90
Monitor4ik    110
Miwka         130
Hardak        170
dtype: int64

In [15]:
a["Compukter" : "Miwka"]

Compukter     2
Monitor4ik    3
Miwka         5
dtype: int64

In [17]:
pd.Series([1, 2, 3], "a b c".split())

a    1
b    2
c    3
dtype: int64

In [19]:
df = pd.DataFrame(rand(5, 4), index = "A B C D E".split(), columns = "W X Y Z".split())

In [20]:
df

          W         X         Y         Z
A  0.460000  0.410756  0.206974  0.243082
B  0.520440  0.562483  0.371243  0.529155
C  0.757265  0.749208  0.515395  0.506058
D  0.733475  0.264736  0.026657  0.199896
E  0.030670  0.130869  0.830444  0.530271

In [21]:
df['W']

A    0.460000
B    0.520440
C    0.757265
D    0.733475
E    0.030670
Name: W, dtype: float64

In [22]:
df["W"]["A"]

0.4599996317202988

In [23]:
df["W"] + df["X"]

A    0.870756
B    1.082923
C    1.506473
D    0.998211
E    0.161540
dtype: float64

In [24]:
cols = ["W", "X"]
df[cols]

          W         X
A  0.460000  0.410756
B  0.520440  0.562483
C  0.757265  0.749208
D  0.733475  0.264736
E  0.030670  0.130869

In [25]:
df[["W", "X"]]

          W         X
A  0.460000  0.410756
B  0.520440  0.562483
C  0.757265  0.749208
D  0.733475  0.264736
E  0.030670  0.130869

In [27]:
df[list(["W", "X"])]

          W         X
A  0.460000  0.410756
B  0.520440  0.562483
C  0.757265  0.749208
D  0.733475  0.264736
E  0.030670  0.130869

In [28]:
df.W

A    0.460000
B    0.520440
C    0.757265
D    0.733475
E    0.030670
Name: W, dtype: float64

In [29]:
df.W.A

0.4599996317202988

In [30]:
df["new"] = [3, 7, 9, 10, 12]

In [31]:
df

          W         X         Y         Z  new
A  0.460000  0.410756  0.206974  0.243082    3
B  0.520440  0.562483  0.371243  0.529155    7
C  0.757265  0.749208  0.515395  0.506058    9
D  0.733475  0.264736  0.026657  0.199896   10
E  0.030670  0.130869  0.830444  0.530271   12

In [32]:
df.new.E

12

In [33]:
df["total"] = df["X"] + df["Z"]

In [34]:
df

          W         X         Y         Z  new     total
A  0.460000  0.410756  0.206974  0.243082    3  0.653838
B  0.520440  0.562483  0.371243  0.529155    7  1.091637
C  0.757265  0.749208  0.515395  0.506058    9  1.255266
D  0.733475  0.264736  0.026657  0.199896   10  0.464632
E  0.030670  0.130869  0.830444  0.530271   12  0.661140

In [38]:
df["W total new X Y Z".split()]

          W     total  new         X         Y         Z
A  0.460000  0.653838    3  0.410756  0.206974  0.243082
B  0.520440  1.091637    7  0.562483  0.371243  0.529155
C  0.757265  1.255266    9  0.749208  0.515395  0.506058
D  0.733475  0.464632   10  0.264736  0.026657  0.199896
E  0.030670  0.661140   12  0.130869  0.830444  0.530271

In [40]:
type(df.W)

pandas.core.series.Series

In [43]:
type(df[["X", "Y"]])

pandas.core.frame.DataFrame

In [44]:
type(df[["W"]])

pandas.core.frame.DataFrame

In [45]:
df.drop("new", axis = 1)

          W         X         Y         Z     total
A  0.460000  0.410756  0.206974  0.243082  0.653838
B  0.520440  0.562483  0.371243  0.529155  1.091637
C  0.757265  0.749208  0.515395  0.506058  1.255266
D  0.733475  0.264736  0.026657  0.199896  0.464632
E  0.030670  0.130869  0.830444  0.530271  0.661140

In [46]:
df

          W         X         Y         Z  new     total
A  0.460000  0.410756  0.206974  0.243082    3  0.653838
B  0.520440  0.562483  0.371243  0.529155    7  1.091637
C  0.757265  0.749208  0.515395  0.506058    9  1.255266
D  0.733475  0.264736  0.026657  0.199896   10  0.464632
E  0.030670  0.130869  0.830444  0.530271   12  0.661140

In [47]:
df.drop("new", axis = 1, inplace=True) # inplace change data frame

In [48]:
df

          W         X         Y         Z     total
A  0.460000  0.410756  0.206974  0.243082  0.653838
B  0.520440  0.562483  0.371243  0.529155  1.091637
C  0.757265  0.749208  0.515395  0.506058  1.255266
D  0.733475  0.264736  0.026657  0.199896  0.464632
E  0.030670  0.130869  0.830444  0.530271  0.661140

In [49]:
df.drop("E")

          W         X         Y         Z     total
A  0.460000  0.410756  0.206974  0.243082  0.653838
B  0.520440  0.562483  0.371243  0.529155  1.091637
C  0.757265  0.749208  0.515395  0.506058  1.255266
D  0.733475  0.264736  0.026657  0.199896  0.464632

In [50]:
df

          W         X         Y         Z     total
A  0.460000  0.410756  0.206974  0.243082  0.653838
B  0.520440  0.562483  0.371243  0.529155  1.091637
C  0.757265  0.749208  0.515395  0.506058  1.255266
D  0.733475  0.264736  0.026657  0.199896  0.464632
E  0.030670  0.130869  0.830444  0.530271  0.661140

In [51]:
df.loc["C"]

W        0.757265
X        0.749208
Y        0.515395
Z        0.506058
total    1.255266
Name: C, dtype: float64

In [52]:
df.iloc[2]

W        0.757265
X        0.749208
Y        0.515395
Z        0.506058
total    1.255266
Name: C, dtype: float64

In [53]:
df.loc[["B", "D"], ["X", "Y"]]

          X         Y
B  0.562483  0.371243
D  0.264736  0.026657

In [54]:
df.iloc[1, 2]

0.37124273631030213

In [55]:
df.iloc[1:3, 2:4]

          Y         Z
B  0.371243  0.529155
C  0.515395  0.506058

In [56]:
df.loc["B":"D", ["X", "Y"]]

          X         Y
B  0.562483  0.371243
C  0.749208  0.515395
D  0.264736  0.026657

In [57]:
df > 0

      W     X     Y     Z  total
A  True  True  True  True   True
B  True  True  True  True   True
C  True  True  True  True   True
D  True  True  True  True   True
E  True  True  True  True   True

In [59]:
df.loc["B"] = [1, 2, 3, 4, 5]

In [60]:
df

          W         X         Y         Z     total
A  0.460000  0.410756  0.206974  0.243082  0.653838
B  1.000000  2.000000  3.000000  4.000000  5.000000
C  0.757265  0.749208  0.515395  0.506058  1.255266
D  0.733475  0.264736  0.026657  0.199896  0.464632
E  0.030670  0.130869  0.830444  0.530271  0.661140

In [62]:
df["W"] > 0

A    True
B    True
C    True
D    True
E    True
Name: W, dtype: bool

In [63]:
(df["W"] > 0) & (df["X"] > 0)

A    True
B    True
C    True
D    True
E    True
dtype: bool

In [64]:
df[(df["W"] > 0) & (df["X"] > 0)]

          W         X         Y         Z     total
A  0.460000  0.410756  0.206974  0.243082  0.653838
B  1.000000  2.000000  3.000000  4.000000  5.000000
C  0.757265  0.749208  0.515395  0.506058  1.255266
D  0.733475  0.264736  0.026657  0.199896  0.464632
E  0.030670  0.130869  0.830444  0.530271  0.661140

In [65]:
df[(df["W"] > 0) & (df["X"] > 0)][["W", "X"]]

          W         X
A  0.460000  0.410756
B  1.000000  2.000000
C  0.757265  0.749208
D  0.733475  0.264736
E  0.030670  0.130869

In [66]:
df[(df["W"] > 0) & (df["X"] > 0)].iloc[0]

W        0.460000
X        0.410756
Y        0.206974
Z        0.243082
total    0.653838
Name: A, dtype: float64

In [67]:
df[(df["W"] > 0) & (df["X"] > 0)].iloc[0:1]

      W         X         Y         Z     total
A  0.46  0.410756  0.206974  0.243082  0.653838

In [68]:
df.reset_index()

  index         W         X         Y         Z     total
0     A  0.460000  0.410756  0.206974  0.243082  0.653838
1     B  1.000000  2.000000  3.000000  4.000000  5.000000
2     C  0.757265  0.749208  0.515395  0.506058  1.255266
3     D  0.733475  0.264736  0.026657  0.199896  0.464632
4     E  0.030670  0.130869  0.830444  0.530271  0.661140

In [69]:
df.reset_index(inplace=True)

In [70]:
df

  index         W         X         Y         Z     total
0     A  0.460000  0.410756  0.206974  0.243082  0.653838
1     B  1.000000  2.000000  3.000000  4.000000  5.000000
2     C  0.757265  0.749208  0.515395  0.506058  1.255266
3     D  0.733475  0.264736  0.026657  0.199896  0.464632
4     E  0.030670  0.130869  0.830444  0.530271  0.661140

In [71]:
df.drop("index", axis=1, inplace=True)

In [72]:
df

          W         X         Y         Z     total
0  0.460000  0.410756  0.206974  0.243082  0.653838
1  1.000000  2.000000  3.000000  4.000000  5.000000
2  0.757265  0.749208  0.515395  0.506058  1.255266
3  0.733475  0.264736  0.026657  0.199896  0.464632
4  0.030670  0.130869  0.830444  0.530271  0.661140

# 1 Multi-index

In [74]:
mdf = pd.DataFrame(randn(6, 3), columns = ["A", "B", "C"])
mdf

          A         B         C
0  0.543054 -0.351520  1.191482
1 -1.143603 -1.347208  1.030684
2 -0.504932 -0.568057 -1.444581
3 -0.297536 -1.655338  0.724967
4  0.717468 -0.567860  0.314597
5 -1.190358  1.897159 -1.869684

In [75]:
mdf.index = pd.MultiIndex(levels = [["Almaty", "Astana"], ["Kids", "Male", "Female"]],
                         labels = [[0, 0, 0, 1, 1, 1],[0, 1, 2, 0, 1, 2]])

In [76]:
mdf

                      A         B         C
Almaty Kids    0.543054 -0.351520  1.191482
       Male   -1.143603 -1.347208  1.030684
       Female -0.504932 -0.568057 -1.444581
Astana Kids   -0.297536 -1.655338  0.724967
       Male    0.717468 -0.567860  0.314597
       Female -1.190358  1.897159 -1.869684

In [77]:
mdf.index.names = ["City", "Sex"]
mdf

                      A         B         C
City   Sex
Almaty Kids    0.543054 -0.351520  1.191482
       Male   -1.143603 -1.347208  1.030684
       Female -0.504932 -0.568057 -1.444581
Astana Kids   -0.297536 -1.655338  0.724967
       Male    0.717468 -0.567860  0.314597
       Female -1.190358  1.897159 -1.869684

In [78]:
mdf.loc["Almaty"].loc["Male"]

A   -1.143603
B   -1.347208
C    1.030684
Name: Male, dtype: float64

In [79]:
mdf.xs(["Almaty", "Male"])

A   -1.143603
B   -1.347208
C    1.030684
Name: (Almaty, Male), dtype: float64

In [80]:
mdf.xs("Male", level = "Sex")

               A         B         C
City
Almaty -1.143603 -1.347208  1.030684
Astana  0.717468 -0.567860  0.314597

### Missing data

In [81]:
df1 = pd.DataFrame({"A" : [1, 2, np.nan], 
                    "B" : [5, np.nan, np.nan], 
                    "C" : [1, 2, 3]})
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [82]:
df1.dropna()

     A    B  C
0  1.0  5.0  1

In [83]:
df1.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [84]:
df1.fillna(value = 0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [86]:
df1["A"] = df1["A"].fillna(value = df1["A"].mean())

In [87]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [88]:
for col in df1.columns:
    df1[col] = df1[col].fillna(value = df1[col].mean())

df1

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [89]:
data = {"Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
       "Person": ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"],
       "Sales": [200, 120, 340, 124, 243, 350]
       }
df = pd.DataFrame(data)

In [90]:
df.head(3) # Show first 3 rows

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340

In [91]:
df.head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243

In [92]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [93]:
df.groupby("Company")

In [94]:
df.groupby("Company").mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [95]:
df.groupby("Company").std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [103]:
df.groupby("Company").min(key = "Sales")

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [97]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [104]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0